In [45]:
import pandas as pd
import numpy as np

In [10]:
obj = pd.Series([4, ["7"], -5, {3: 5}])
obj

0         4
1       [7]
2        -5
3    {3: 5}
dtype: object

In [12]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [13]:
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])

In [14]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [15]:
obj2 > 0

d     True
b     True
a    False
c     True
dtype: bool

In [16]:
obj2["hello"] = 55

In [17]:
obj2

d         4
b         7
a        -5
c         3
hello    55
dtype: int64

In [18]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}
obj3 = pd.Series(sdata)

In [19]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [22]:
s1 = pd.Series({'a': 1, 'b': 2, 'c': 3, 'g': 15})
s2 = pd.Series({'b': 3, 'c': 4, 'd': 5})

In [23]:
s1+s2

a    NaN
b    5.0
c    7.0
d    NaN
g    NaN
dtype: float64

In [136]:
states = ["California", "Ohio", "Oregon", "Texas"]
obj2= pd.Series(sdata, index=states)

In [137]:
obj2.index = ['hello', '1', '2', '4']

In [29]:
obj4[pd.notna(obj4)]

Ohio      35000.0
Oregon    16000.0
Texas     71000.0
dtype: float64

In [30]:
obj4.name = "population"
obj4.index.name = 'State'

In [31]:
obj4

State
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [32]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [33]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [34]:
frame.head(4)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4

In [35]:
frame.tail(2)

    state  year  pop
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [59]:
frame = pd.DataFrame(data, columns=["year", "state", "pop", 'debt'])

In [60]:
frame.debt = np.arange(6)

In [61]:
frame.debt

0    0
1    1
2    2
3    3
4    4
5    5
Name: debt, dtype: int64

In [62]:
frame

   year   state  pop  debt
0  2000    Ohio  1.5     0
1  2001    Ohio  1.7     1
2  2002    Ohio  3.6     2
3  2001  Nevada  2.4     3
4  2002  Nevada  2.9     4
5  2003  Nevada  3.2     5

In [63]:
val = pd.Series([-1.2, -1.5, -1.7], index=[2, 4, 5])

In [64]:
val

2   -1.2
4   -1.5
5   -1.7
dtype: float64

In [65]:
frame["debt"] = val

In [66]:
frame

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [99]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
                "Nevada": {2001: 2.4, 2002: 2.9}}

In [100]:
populations

{'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}, 'Nevada': {2001: 2.4, 2002: 2.9}}

In [101]:
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [139]:
frame3.index

Index([2000, 2001, 2002], dtype='int64')

In [123]:
pd.DataFrame(populations, index=[2001, 2002, 2003]).index

Index([2001, 2002, 2003], dtype='int64')

In [93]:
test = {'hey': [1, 2],
        'hello': [1]}

In [102]:
sdata.ndim

AttributeError: 'dict' object has no attribute 'ndim'

In [104]:
s1.ndim

1

In [118]:
twod_array = np.ones([3, 2])

In [119]:
twod_array

array([[1., 1.],
       [1., 1.],
       [1., 1.]])

In [120]:
twod_array.ndim

2

In [122]:
pd.DataFrame(twod_array)

     0    1
0  1.0  1.0
1  1.0  1.0
2  1.0  1.0

In [124]:
obj = pd.Series(np.arange(3), index=["a", "b", "c"])

In [132]:
obj.index

Index(['a', 'b', 'c'], dtype='object')

In [133]:
labels = pd.Index(np.arange(3))

In [134]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [135]:
obj2.index is labels

True

In [142]:
pd.Series([1, ['g', 'g']])

<NumpyExtensionArray>
[1, ['g', 'g']]
Length: 2, dtype: object

In [143]:
data = {
    "product_name": ["Laptop", "Smartphone", "Keyboard", "Tablet", "Headphones", "Router", "PC"],
    "quantity": [1, 2, 1, 3, 1, 2, 4],
    "price": [1200, 800, 120, 300, 150, 200, 1300],
    "order_date": ["2024-07-01", "2024-07-03", "2024-07-05", "2024-07-07", "2024-07-09", "2024-07-10", "2024-07-02"],
}

sales_info = pd.DataFrame(data)
print(sales_info)

  product_name  quantity  price  order_date
0       Laptop         1   1200  2024-07-01
1   Smartphone         2    800  2024-07-03
2     Keyboard         1    120  2024-07-05
3       Tablet         3    300  2024-07-07
4   Headphones         1    150  2024-07-09
5       Router         2    200  2024-07-10
6           PC         4   1300  2024-07-02

In [150]:
sales_info.values

array([['Laptop', 1, 1200, '2024-07-01'],
       ['Smartphone', 2, 800, '2024-07-03'],
       ['Keyboard', 1, 120, '2024-07-05'],
       ['Tablet', 3, 300, '2024-07-07'],
       ['Headphones', 1, 150, '2024-07-09'],
       ['Router', 2, 200, '2024-07-10'],
       ['PC', 4, 1300, '2024-07-02']], dtype=object)

In [151]:
sales_info.shape

(7, 4)

In [152]:
sales_info.dtypes

product_name    object
quantity         int64
price            int64
order_date      object
dtype: object

In [153]:
sales_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   product_name  7 non-null      object
 1   quantity      7 non-null      int64
 2   price         7 non-null      int64
 3   order_date    7 non-null      object
dtypes: int64(2), object(2)
memory usage: 352.0+ bytes

In [155]:
sales_info.describe()

       quantity        price
count  7.000000     7.000000
mean   2.000000   581.428571
std    1.154701   511.612763
min    1.000000   120.000000
25%    1.000000   175.000000
50%    2.000000   300.000000
75%    2.500000  1000.000000
max    4.000000  1300.000000

In [157]:
sales_info.value_counts()

product_name  quantity  price  order_date
Headphones    1         150    2024-07-09    1
Keyboard      1         120    2024-07-05    1
Laptop        1         1200   2024-07-01    1
PC            4         1300   2024-07-02    1
Router        2         200    2024-07-10    1
Smartphone    2         800    2024-07-03    1
Tablet        3         300    2024-07-07    1
Name: count, dtype: int64

In [158]:
print(f"Unique values: {sales_info['product_name'].unique()}")
print(f"Number of unique values: {sales_info['product_name'].nunique()}")

Unique values: ['Laptop' 'Smartphone' 'Keyboard' 'Tablet' 'Headphones' 'Router' 'PC']
Number of unique values: 7

In [ ]:
usd_data = pd.read_json("https://api.exchangerate-api.com/v4/latest/USD")
usd_data.head()